Revit 2027 API
ParameterTypeId.EnergyAnalysisBuildingOperatingSchedule Property
 "Building Operating Schedule": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get; }
Public Shared ReadOnly Property EnergyAnalysisBuildingOperatingSchedule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisBuildingOperatingSchedule {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisBuildingOperatingSchedule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace